---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.RailingType
source: html/76dfcf47-cdc3-4b0a-4c6e-c228afa700bf.htm
---
# RailingType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.